/// 参考 : 日本電線工業会資料, https://www.jcma2.jp/index.html
/// 参考 : フジクラ・ダイヤケーブル技術資料, https://www.fujikura-dia.co.jp/tech/
/// 参考 : 古河電工, https://www.furukawa.co.jp/
/// 参考 : パナソニック株式会社法人向け, https://www2.panasonic.biz/jp/

class CableConduitDataClass {
  Map selectCableData(_str) {
    if (_str == '600V CV-2C') {
      return cableData600VCV2C;
    } else if (_str == '600V CV-3C') {
      return cableData600VCV3C;
    } else if (_str == '600V CVT') {
      return cableData600VCVT;
    } else {
      return cableDataIV;
    }
  }

  Map selectConduitData(_str) {
    if (_str == 'PF管') {
      return conduitPF;
    } else if (_str == 'C管(薄鋼)') {
      return conduitCP;
    } else if (_str == 'G管(厚鋼)') {
      return conduitGP;
    } else {
      return conduitFEP;
    }
  }

  /// 600V CV-2C, 気中暗渠布設, 50Hz
  /// <ケーブルサイズ(sq), [抵抗(Ω/km), リアクタンス(Ω/km), 許容電流(A), 仕上外径(mm)]>
  Map<String, List> cableData600VCV2C = {
    '2': [12.0, 0.0992, 28, 10.5],
    '3.5': [6.76, 0.0914, 39, 11.5],
    '5.5': [4.34, 0.0914, 52, 13.5],
    '8': [2.98, 0.087, 65, 15.0],
    '14': [1.71, 0.0828, 91, 16.5],
    '22': [1.08, 0.082, 120, 19.5],
    '38': [0.626, 0.0771, 170, 24],
    '60': [0.397, 0.0768, 225, 29],
    '100': [0.239, 0.0773, 310, 37],
    '150': [0.16, 0.0744, 400, 43],
    '200': [0.121, 0.0755, 485, 50],
    '250': [0.0985, 0.0739, 560, 54],
    '325': [0.077, 0.0723, 660, 60],
  };

  /// 600V CV-3C, 気中暗渠布設, 50Hz
  /// <ケーブルサイズ(sq), [抵抗(Ω/km), リアクタンス(Ω/km), 許容電流(A), 仕上外径(mm)]>
  Map<String, List> cableData600VCV3C = {
    '2': [12.0, 0.0992, 23, 11.0],
    '3.5': [6.76, 0.0914, 33, 12.5],
    '5.5': [4.34, 0.0914, 44, 14.5],
    '8': [2.98, 0.087, 54, 16.0],
    '14': [1.71, 0.0828, 76, 17.5],
    '22': [1.08, 0.082, 100, 21],
    '38': [0.626, 0.0771, 140, 25],
    '60': [0.397, 0.0768, 190, 31],
    '100': [0.239, 0.0773, 260, 40],
    '150': [0.16, 0.0744, 340, 46],
    '200': [0.121, 0.0755, 410, 54],
    '250': [0.0985, 0.0739, 470, 58],
    '325': [0.077, 0.0723, 555, 65],
  };

  /// 600V CVT 気中暗渠布設, 50Hz
  /// <ケーブルサイズ(sq), [抵抗(Ω/km), リアクタンス(Ω/km), 許容電流(A), 1条あたりの仕上外径(mm)]>
  Map<String, List> cableData600VCVT = {
    '8': [2.98, 0.0943, 62, 8.6],
    '14': [1.71, 0.107, 86, 9.4],
    '22': [1.08, 0.103, 110, 11],
    '38': [0.626, 0.0955, 155, 13],
    '60': [0.397, 0.0913, 210, 15.5],
    '100': [0.239, 0.0881, 290, 19],
    '150': [0.159, 0.0846, 380, 22],
    '200': [0.0121, 0.0859, 465, 26],
    '250': [0.0981, 0.0836, 535, 28],
    '325': [0.0764, 0.0816, 635, 31],
  };

  /// 600V IV 同一管内に3本以下の場合
  /// <ケーブルサイズ(sq), [抵抗(Ω/km), リアクタンス(Ω/km), 許容電流(A), 仕上外径(mm)]>
  Map<String, List> cableDataIV = {
    '2': [10.7, 0.114, 18, 3.4],
    '3.5': [6.02, 0.106, 25, 4],
    '5.5': [3.85, 0.106, 34, 5],
    '8': [2.67, 0.106, 42, 6],
    '14': [1.5, 0.103, 61, 7.6],
    '22': [0.954, 0.101, 80, 9.2],
    '38': [0.564, 0.0976, 113, 11.5],
    '60': [0.351, 0.0931, 152, 14],
    '100': [0.209, 0.0906, 208, 17],
    '150': [0.138, 0.089, 276, 21],
    '200': [0.109, 0.0885, 328, 23],
    '250': [0.0864, 0.0869, 389, 26],
    '325': [0.069, 0.0864, 455, 29],
  };

  /// 電線管PFのデータ
  /// {'サイズ名称' : 内径}
  Map<String, int> conduitPF = {
    'PF14': 14,
    'PF16': 16,
    'PF22': 22,
    'PF28': 28,
    'PF36': 36
  };

  /// C管(薄鋼電線管)のデータ
  /// {'サイズ名称' : 内径}
  Map<String, double> conduitCP = {
    'C19': 15.9,
    'C25': 22.2,
    'C31': 28.6,
    'C39': 34.9,
    'C51': 47.6,
    'C63': 59.5,
    'C75': 72.2
  };

  /// G管(厚鋼電線管)のデータ
  /// {'サイズ名称' : 内径}
  Map<String, double> conduitGP = {
    'G16': 16.4,
    'G22': 21.9,
    'G28': 28.3,
    'G36': 36.9,
    'G42': 42.8,
    'G54': 54,
    'G70': 69.6,
    'G82': 82.3,
    'G92': 93.7,
    'G104': 106.4,
  };

  /// FEP管のデータ
  /// {'サイズ名称' : 内径}
  Map<String, double> conduitFEP = {
    'FEP30': 30,
    'FEP40': 42,
    'FEP50': 50,
    'FEP65': 66,
    'FEP80': 80,
    'FEP100': 100,
    'FEP125': 125,
    'FEP150': 150,
    'FEP200': 200,
  };
}
